{
  "selectedTemplate": 4,
  "headings": {
    "skills": "Skills",
    "projects": "",
    "awards": "",
    "education": "Education",
    "work": "Experience"
  },
  "basics": {
    "name": "Arnab Ray",
    "email": "ray.arnab008@gmail.com",
    "phone": "9886374828",
    "website": "https://www.linkedin.com/in/arnab008/"
  },
  "work": [
    {
      "location": "Bangalore",
      "website": "",
      "endDate": "Present",
      "highlights": [
        "Built the procurement system, to place purchase order for procuring goods. Was involved in conception, design, development and deployment of it.",
        "Built the workflow of Just-In-Time procurement from scratch for three working models, having integration with our invoicing, fulfilment and supply chain. Also integrated this workflow with third-party vendors like Unicommerce, Capillary Tech, Vinculum.",
        "Built vendor selection platform with a peak qps of 500 with 50ms of p99 latency.",
        "Implemented state machine as a library with persistence support.",
        "Implemented a distributed lock library based on cosmosDB.",
        "Reduced cost for the microservices by optimising DB queries.",
        "Revamped product catalog system and refactored procurement to reduce IRN-GRN mismatch.",
        "Moved the monolith “first-party service” to micro-services.",
        "Improved coding practices by introducing eliminating blocking codes, incorporated code linters, adding unit tests."
      ],
      "company": "Udaan",
      "position": "Software Engineer L4",
      "startDate": "Feb 2020"
    },
    {
      "highlights": [
        "Created the engine to support feasibility check for all post order modifications by the customer like changing payment mode, changing address, rescheduling delivery slot or delivery date. It had a qps of 500 reads and 200 writes.",
        "Implemented fulfilment of multi-part shipment helping to scale furniture vertical. Sticky SLA and easy replacements were facilitated by the feature.",
        "Implemented fulfilment of grocery handling slotted delivery and lot managed inventory. Extremely critical for scaling up repeat customers.",
        "Designed and built the capability of multi-location of sellers (third party) and pre- orders for slotted delivery. This helped us to onboard sellers like Decathlon and Big Bazar on to our platform.",
        "Scaled fulfilment from 100 qps to 300 qps by sharding DB and optimising code.",
        "Built the environment for testing new features using production load, supporting both read and write APIs."
      ],
      "company": "Flipkart Internet Pvt. Ltd.",
      "position": "Software Engineer II",
      "location": "Bangalore",
      "startDate": "Mar 2016",
      "endDate": "Feb 2020"
    },
    {
      "highlights": [
        "Developed installer for Unisphere for VMAX, this was a host management software, this had variant for Chinese market and a cloud platform.",
        "Created and maintained build scripts for the builds."
      ],
      "company": "EMC Corporation",
      "position": "Sr. Software Engineer",
      "location": "Bangalore",
      "startDate": "Aug 2013",
      "endDate": "Mar 2016"
    }
  ],
  "education": [
    {
      "institution": "Indian Institute of Technology Guwahati",
      "area": "Computer Science",
      "studyType": "M.Tech",
      "endDate": "2013",
      "gpa": "8.78",
      "startDate": "2011"
    },
    {
      "institution": "West Bengal University of Technology",
      "studyType": "B.Tech",
      "area": "Computer Science",
      "gpa": "8.87",
      "startDate": "2007",
      "endDate": "2011"
    }
  ],
  "skills": [
    {
      "name": "Programming Languages",
      "level": "",
      "keywords": [
        "Java, Kotlin, Ruby, C, Typescript, ReactJS, Python, Shell Script, Perl, R"
      ]
    },
    {
      "keywords": [
        "MySQL, Postgres, Azure SQL Server, Redis, MongoDB, Azure CosmosDB"
      ],
      "name": "Databases"
    },
    {
      "keywords": [
        "Dropwizard, Padrino"
      ],
      "name": "Framework"
    },
    {
      "keywords": [
        "JDBI, Hibernate, ActiveRecord."
      ],
      "name": "ORM"
    }
  ],
  "projects": [
    {
      "name": "",
      "description": "",
      "url": "",
      "keywords": [
        ""
      ]
    }
  ],
  "awards": [
    {
      "title": "",
      "date": "",
      "awarder": "",
      "summary": ""
    }
  ],
  "sections": [
    "templates",
    "profile",
    "work",
    "education",
    "skills",
    "projects",
    "awards"
  ]
}